In [4]:
import numpy as np
import pandas as pd

##### FROM AN ARRAY

In [3]:
# Create an array
first_data_example = np.array([[1, 2], [2, 4]])
first_data_example

array([[1, 2],
       [2, 4]])

In [4]:
# Common name for a DataFrame: df

first_dataframe = pd.DataFrame(first_data_example, index=["lol", "lel"], columns=["col1", "col2"])
first_dataframe

     col1  col2
lol     1     2
lel     2     4

##### FROM A LIST

In [5]:
# Create an array
example_list = [[1, 2], [2, 4]]
example_list

[[1, 2], [2, 4]]

In [7]:
second_df = pd.DataFrame(example_list)
second_df

   0  1
0  1  2
1  2  4

##### FROM A DICTIONARY

In [ ]:
maldini_keys = ["age", "colour", "sex"]
maldini_values = ["56", "red and black", "yes"]

In [2]:
maldini_dict = {"keys":maldini_keys, "values": maldini_values}
maldini_dict

{'keys': ['age', 'colour', 'sex'], 'values': ['56', 'red and black', 'yes']}

In [5]:
df = pd.DataFrame({"keys":maldini_keys, "values": maldini_values})
df

     keys         values
0     age             56
1  colour  red and black
2     sex            yes